tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "mdogan/zulu"

# Essentiel
brew "git"
brew "maven"
brew "python"
brew "node"
brew "npm"
brew "mas"

# Java 
cask "zulu-jdk19"
cask "zulu-jdk11"
cask "zulu-jdk8"

# Backup
brew "borgbackup"
brew "borgmatic"
cask "timemachineeditor"

# Outils
cask "monitorcontrol"
cask "bettermouse"
cask "appcleaner"
cask "chromium"
cask "bartender"
cask "setapp"
mas "ColorSlurp", id: 1287239339
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353

# Productivité
cask "notion"
cask "discord-ptb"
cask "discord-canary"
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Todoist", id: 585829637

# Développement
cask "visual-studio-code"
cask "intellij-idea"
cask "phpstorm"
cask "dbeaver-community"

# Admin
cask "royal-tsx"
mas "Termius", id: 1176074088

# Jeux
cask "manymc"
cask "league-of-legends"

# Sécurité
mas "Bitwarden", id: 1352778147

# Extensions Safari
mas "PiPifier", id: 1160374471
mas "Wipr", id: 1320666476
